
function clickOnCalc(event) {
    /**
     * Виведе елемент в консоль, на якому спрацювала подія ('click')
     */
    console.log(event.target);
}

/**
 * Записуємо елемент в змінну 'div', на якому хочемо відслідковувати кліки (в даному випадку це батьківський 'div')
 * @type {Element}
 */
let div = document.querySelector('.calc');

/**
 * Реєструємо власний метод що буде виконаний (викликаний) на подію (в даному випадку 'click'),
 * яка буде відслідковувати кліки на вибраному елементові.
 *
 * В даному випадку <div class ="calc"></div> - це елемент, на який нажали всередині:
 * - або на сам елемент безпосередьно;
 * - або на його 'дітей'.
 *
 * Отже, js передає в метод (функцію) об'єкт 'event', що буде "мати в собі" властивість 'event.target',
 * в якій буде знаходитись оснанній по вложеності елемент, на який було здійснено клік
 */
div.addEventListener('click', clickOnCalc);